Ran Plan for dir: `aws-ec2-self-hosted-vpn` workspace: `default`

<details><summary>Show Output</summary>

```diff
data.aws_ami.ubuntu: Reading...
data.aws_vpc.default: Reading...
data.aws_ami.ubuntu: Read complete after 1s [id=ami-004811053d831c2c2]
data.aws_vpc.default: Read complete after 2s [id=vpc-abe5b8d1]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # aws_instance.vpn will be created
+ resource "aws_instance" "vpn" {
      + ami                                  = "ami-004811053d831c2c2"
      + arn                                  = (known after apply)
      + associate_public_ip_address          = true
      + availability_zone                    = (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      + disable_api_stop                     = (known after apply)
      + disable_api_termination              = (known after apply)
      + ebs_optimized                        = (known after apply)
      + get_password_data                    = false
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      + id                                   = (known after apply)
      + instance_initiated_shutdown_behavior = (known after apply)
      + instance_state                       = (known after apply)
      + instance_type                        = "t4g.nano"
      + ipv6_address_count                   = (known after apply)
      + ipv6_addresses                       = (known after apply)
      + key_name                             = "ssh-us-east-1"
      + monitoring                           = (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      + placement_partition_number           = (known after apply)
      + primary_network_interface_id         = (known after apply)
      + private_dns                          = (known after apply)
      + private_ip                           = (known after apply)
      + public_dns                           = (known after apply)
      + public_ip                            = (known after apply)
      + secondary_private_ips                = (known after apply)
      + security_groups                      = (known after apply)
      + source_dest_check                    = true
      + subnet_id                            = (known after apply)
      + tags                                 = {
          + "Name" = "tailscale-exit-node-us-east-1"
        }
      + tags_all                             = {
          + "Name" = "tailscale-exit-node-us-east-1"
        }
      + tenancy                              = (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = "IyEvYmluL2Jhc2gKCnNldCAtZXV4CgojIHVwZGF0ZSBwYWNrYWdlcwpzdWRvIGFwdC1nZXQgdXBkYXRlIC15CgojIHNldCBob3N0bmFtZQpzdWRvIGhvc3RuYW1lY3RsIHNldC1ob3N0bmFtZSAidGFpbHNjYWxlLWV4aXQtbm9kZS11cy1lYXN0LTEiCgojIEluc3RhbGwgVGFpbHNjYWxlIG9uIFVidW50dSAyMi4wNApjdXJsIC1mc1NMIGh0dHBzOi8vdGFpbHNjYWxlLmNvbS9pbnN0YWxsLnNoIHwgc2gKCiMgRW5hYmxlIElQIGZvcndhcmRpbmcKZWNobyAnbmV0LmlwdjQuaXBfZm9yd2FyZCA9IDEnIHwgc3VkbyB0ZWUgLWEgL2V0Yy9zeXNjdGwuZC85OS10YWlsc2NhbGUuY29uZgplY2hvICduZXQuaXB2Ni5jb25mLmFsbC5mb3J3YXJkaW5nID0gMScgfCBzdWRvIHRlZSAtYSAvZXRjL3N5c2N0bC5kLzk5LXRhaWxzY2FsZS5jb25mCnN1ZG8gc3lzY3RsIC1wIC9ldGMvc3lzY3RsLmQvOTktdGFpbHNjYWxlLmNvbmYKCiMgRW5hYmxlIFRhaWxzY2FsZSBhcyBleGl0IG5vZGUKc3VkbyB0YWlsc2NhbGUgdXAgLS1hdXRoa2V5ICJ0c2tleS1hdXRoLWtZMlIxMjdDTlRSTC04eFRyNVUxTlFGU0xZcGEyWjRiaUVTUFlVOXZEUDRGZiIgLS1ob3N0bmFtZSAidGFpbHNjYWxlLWV4aXQtbm9kZS11cy1lYXN0LTEiIC0tYWR2ZXJ0aXNlLWV4aXQtbm9kZSA="
      + user_data_replace_on_change          = false
      + vpc_security_group_ids               = (known after apply)
    }

  # aws_security_group.vpn will be created
+ resource "aws_security_group" "vpn" {
      + arn                    = (known after apply)
      + description            = "Allow SSH traffic"
      + egress                 = (known after apply)
      + id                     = (known after apply)
      + ingress                = (known after apply)
      + name                   = "vpn-sg"
      + name_prefix            = (known after apply)
      + owner_id               = (known after apply)
      + revoke_rules_on_delete = false
      + tags_all               = (known after apply)
      + vpc_id                 = "vpc-abe5b8d1"
    }

  # aws_security_group_rule.all_egress will be created
+ resource "aws_security_group_rule" "all_egress" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 0
      + id                       = (known after apply)
      + protocol                 = "-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 0
      + type                     = "egress"
    }

  # aws_security_group_rule.ssh will be created
+ resource "aws_security_group_rule" "ssh" {
      + cidr_blocks              = [
          + "0.0.0.0/0",
        ]
      + from_port                = 22
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 22
      + type                     = "ingress"
    }

Plan: 4 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+ ec2_public_dns = (known after apply)
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -d aws-ec2-self-hosted-vpn`
* :put_litter_in_its_place: To **delete** this plan click [here](http://ec2-3-108-5-129.ap-south-1.compute.amazonaws.com:4141/lock?id=subhasis020299%252Fterraform-infra-personal%252Faws-ec2-self-hosted-vpn%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -d aws-ec2-self-hosted-vpn -- -var tailscale_authkey=tskey-auth-kY2R127CNTRL-8xTr5U1NQFSLYpa2Z4biESPYU9vDP4Ff`
</details>
Plan: 4 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`